In [1]:
import pandas as pd
import numpy as np
from sklearn.impute import SimpleImputer
np.random.seed(42)


df = pd.read_csv('../Datasets/Dataset_Performances_Sportives.csv')
df

,nom_athlete,discipline,temps_performance,nombre_medailles,score_performance
0,Athlete1,Natation,13.458232,NaN,89.506568
1,Athlete2,Triathlon,NaN,2.0,62.805558
2,Athlete3,Course,10.925203,NaN,68.106297
3,Athlete4,Triathlon,NaN,4.0,84.115257
4,Athlete5,Natation,11.337710,NaN,61.702935
...,...,...,...,...,...
495,Athlete496,Course,11.617301,NaN,83.926334
496,Athlete497,Cyclisme,NaN,5.0,59.735148
497,Athlete498,Natation,16.139037,NaN,65.058655
498,Athlete499,Course,NaN,1.0,88.225056
499,Athlete500,Course,19.808700,NaN,59.751464

In [2]:
df.isnull().sum()

nom_athlete            0
discipline           157
temps_performance    174
nombre_medailles     169
score_performance      0
dtype: int64

In [3]:
# colonnes = 


# imputer = 

# colonne_imputed = imputer.fit_transform(df[colonnes])

# df[colonnes] = colonne_imputed
# df.head(10)

In [4]:
df.isnull().sum()

nom_athlete            0
discipline           157
temps_performance    174
nombre_medailles     169
score_performance      0
dtype: int64